<?php
use Carbon\Carbon;
use Faker\Generator as Faker;

$factory->define(App\Houses::class, function (Faker $faker) {
    $names = [
        "コーポグランデュオ",
        "モンシャトー加藤",
        "ホテルエリゼア",
        "カフェレストラン紅",
        "田中さんのオウチ",
        "ゲートパークロゼッタ",
        "コインスペース",
    ];
    $host_names = [
        "松岡修造",
        "安倍晋三",
        "織田信長",
        "石田三成",
        "高杉晋作",
        "田中みな実",
        "薬師丸ひろ子",
    ];
    $zips = [
        "191-2342",
        "738-2283",
        "532-8832",
        "212-3365",
        "332-2143",
        "221-3349",
    ];
    $prefectures = [
        "富山県",
        "東京都",
        "静岡県",
        "熊本県",
        "福島県",
        "京都府",
        "大阪府",
        "北海道",
        "山口県",
        "鹿児島県",
        "沖縄県",
    ];
    $citys = [
        "徳山市",
        "永田市",
        "下関市",
        "宇部市",
        "鳥取市",
        "桜丘市",
    ];
    return [
        //
    ];
});
